# Lab: Pandas Data Loading & Indexing

Read in the file `data/states.csv`

In [6]:
import pandas as pd
data = pd.read_csv('data/states.csv')

Examine the file

In [7]:
data.head()

  Abbreviation       state     area         pop
0           AL     Alabama   135767   4874747.0
1           AK      Alaska  1723337    739795.0
2           AZ     Arizona   295234   7016270.0
3           AR    Arkansas   137732   3004279.0
4           CA  California   423967  39536653.0

Re-read the file, using the Abbreviation as an index

In [9]:
data = pd.read_csv('data/states.csv', index_col=0)
data.head()

                   state     area         pop
Abbreviation
AL               Alabama   135767   4874747.0
AK                Alaska  1723337    739795.0
AZ               Arizona   295234   7016270.0
AR              Arkansas   137732   3004279.0
CA            California   423967  39536653.0

Find the largest state by land area

In [20]:
data.area.max()
data[data.area==data.area.max()]
# or
data.loc[data.area.idxmax()]

state     Alaska
area     1723337
pop       739795
Name: AK, dtype: object

Create a dataframe with just Florida, Georgia, Alabama, and South Carolina

In [28]:
pd.DataFrame(data.loc['FL'])

                FL
state      Florida
area        170312
pop    2.09844e+07

Save the new dataframe to southeast.csv  (there is a `DataFrame.to_csv()` method)

Read in the sales data `data/sales.csv`

Find the average line quantity during the month of June, 2011

Read the stock data `data/closing_prices.csv`

Examine its structure

Find the min, max, mean, and median price of AAPL during June of 2015

# Lab: Data Cleansing

Read the file `data/dirty_prices.csv`

In [30]:
data = pd.read_csv('data/dirty_prices.csv')

Examine its structure

In [31]:
data.head()

       sku category      price
0  sku0000  Toilets  $2,085.11
1  sku0001     Misc  $3,601.62
2  sku0002     Misc      $0.57
3  sku0003  Faucets  $1,511.66
4  sku0004  Toilets    $733.78

Make price a float series

In [43]:
import re
dollar_comma = re.compile(r'[$,]')
data.price = data.price.str.replace(dollar_comma,'').astype(float)
data.head()

       sku category    price
0  sku0000  Toilets  2085.11
1  sku0001     Misc  3601.62
2  sku0002     Misc     0.57
3  sku0003  Faucets  1511.66
4  sku0004  Toilets   733.78

Fix the categories

Find any outliers and do something sensible with them

Write your file out to `data/prices.csv`

# Lab: Grouping and merging dataframes

Read the files prices.csv (from the previous exercise) and sales.csv

Examine their structure

Create a new dataframe that merges the price and category data with the sales data

Create a dataframe indexed by order number that contains the total price for the order

Create a dataframe with the monthly average sales per category